# Pandas 2
Â© Advanced Analytics, Amir Ben Haim, 2024

## Cleaning Data

Data containing malformed strings, Python lists and missing data.
Tidy it up so you can get on with the analysis.

<p style = "color:red" >Notice</p>
<p style = "color:red" >This part is more technical than methodological </p>

In [2]:
### First we have to import the pandas libraries to the environment
import pandas as pd

<br>
<hr class="dotted">
<br>

### Messy Data

Take a look at this terrible DataFrame,
let's clean it up !

In [3]:
dic = {'Country': ['LoNDon_britian', 'Brussels_BelgIUm', 'MAdrid_spAIN', 'londON_briTiAn', 'Budapest_PraG','Brussels_BelgIUm'],
         'ProductId': [35, 77000, None, 53, None,77000],
         'SalesHistory': [[23, 47,88], [67, 32], [], [24, 43, 87], [13],[67, 32]],
         'Category': ['(Broken Glass. )', '98. Plastic', '<Hard Wood> (45)', 'STEEL(&)','"Lether"','98. Plastic'],
         'Date':['2018/12/01', '2017/10/05', '2018/11/11', None, '2017/06/10','2017/10/05'],
         'Division': [['div_a', 'sub_div_a'], ['div_b', 'sub_div_b'], [], ['div_c', 'sub_div_c'], ['div_d'],['div_b', 'sub_div_b']]
      }

df = pd.DataFrame(dic)
df

,Country,ProductId,SalesHistory,Category,Date,Division
0,LoNDon_britian,35.0,"[23, 47, 88]",(Broken Glass. ),2018/12/01,"[div_a, sub_div_a]"
1,Brussels_BelgIUm,77000.0,"[67, 32]",98. Plastic,2017/10/05,"[div_b, sub_div_b]"
2,MAdrid_spAIN,NaN,[],<Hard Wood> (45),2018/11/11,[]
3,londON_briTiAn,53.0,"[24, 43, 87]",STEEL(&),None,"[div_c, sub_div_c]"
4,Budapest_PraG,NaN,[13],"""Lether""",2017/06/10,[div_d]
5,Brussels_BelgIUm,77000.0,"[67, 32]",98. Plastic,2017/10/05,"[div_b, sub_div_b]"

<br>
<hr class="dotted">
<br>

### Drop rows with Null

In [4]:
# dropna() --> Return a new Data Frame with no empty cells
df_new = df.dropna()
df_new

,Country,ProductId,SalesHistory,Category,Date,Division
0,LoNDon_britian,35.0,"[23, 47, 88]",(Broken Glass. ),2018/12/01,"[div_a, sub_div_a]"
1,Brussels_BelgIUm,77000.0,"[67, 32]",98. Plastic,2017/10/05,"[div_b, sub_div_b]"
5,Brussels_BelgIUm,77000.0,"[67, 32]",98. Plastic,2017/10/05,"[div_b, sub_div_b]"

In [5]:
# dropna()  -->  By default, the method returns a new DataFrame, and will not change the original
df.dropna()
df
# Nothing happened

,Country,ProductId,SalesHistory,Category,Date,Division
0,LoNDon_britian,35.0,"[23, 47, 88]",(Broken Glass. ),2018/12/01,"[div_a, sub_div_a]"
1,Brussels_BelgIUm,77000.0,"[67, 32]",98. Plastic,2017/10/05,"[div_b, sub_div_b]"
2,MAdrid_spAIN,NaN,[],<Hard Wood> (45),2018/11/11,[]
3,londON_briTiAn,53.0,"[24, 43, 87]",STEEL(&),None,"[div_c, sub_div_c]"
4,Budapest_PraG,NaN,[13],"""Lether""",2017/06/10,[div_d]
5,Brussels_BelgIUm,77000.0,"[67, 32]",98. Plastic,2017/10/05,"[div_b, sub_div_b]"

In [6]:
df = df.dropna()
df

,Country,ProductId,SalesHistory,Category,Date,Division
0,LoNDon_britian,35.0,"[23, 47, 88]",(Broken Glass. ),2018/12/01,"[div_a, sub_div_a]"
1,Brussels_BelgIUm,77000.0,"[67, 32]",98. Plastic,2017/10/05,"[div_b, sub_div_b]"
5,Brussels_BelgIUm,77000.0,"[67, 32]",98. Plastic,2017/10/05,"[div_b, sub_div_b]"

In [7]:
# If you want to change the original DataFrame, use the "inplace = True" argument
df.dropna(inplace = True)
df

C:\Users\itaig\AppData\Local\Temp\ipykernel_38844\919960508.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.dropna(inplace = True)

,Country,ProductId,SalesHistory,Category,Date,Division
0,LoNDon_britian,35.0,"[23, 47, 88]",(Broken Glass. ),2018/12/01,"[div_a, sub_div_a]"
1,Brussels_BelgIUm,77000.0,"[67, 32]",98. Plastic,2017/10/05,"[div_b, sub_div_b]"
5,Brussels_BelgIUm,77000.0,"[67, 32]",98. Plastic,2017/10/05,"[div_b, sub_div_b]"

In [8]:
# Back to empty rows
df = pd.DataFrame(dic)
df

,Country,ProductId,SalesHistory,Category,Date,Division
0,LoNDon_britian,35.0,"[23, 47, 88]",(Broken Glass. ),2018/12/01,"[div_a, sub_div_a]"
1,Brussels_BelgIUm,77000.0,"[67, 32]",98. Plastic,2017/10/05,"[div_b, sub_div_b]"
2,MAdrid_spAIN,NaN,[],<Hard Wood> (45),2018/11/11,[]
3,londON_briTiAn,53.0,"[24, 43, 87]",STEEL(&),None,"[div_c, sub_div_c]"
4,Budapest_PraG,NaN,[13],"""Lether""",2017/06/10,[div_d]
5,Brussels_BelgIUm,77000.0,"[67, 32]",98. Plastic,2017/10/05,"[div_b, sub_div_b]"

<br>
<hr class="dotted">
<br>

### Fill rows that contain Null

In [9]:
# If we don't want to delete entire rows just because of some empty cells
# We can use "fillna()" method --> replace empty cells with a value
df.fillna(100,inplace = True)
df

,Country,ProductId,SalesHistory,Category,Date,Division
0,LoNDon_britian,35.0,"[23, 47, 88]",(Broken Glass. ),2018/12/01,"[div_a, sub_div_a]"
1,Brussels_BelgIUm,77000.0,"[67, 32]",98. Plastic,2017/10/05,"[div_b, sub_div_b]"
2,MAdrid_spAIN,100.0,[],<Hard Wood> (45),2018/11/11,[]
3,londON_briTiAn,53.0,"[24, 43, 87]",STEEL(&),100,"[div_c, sub_div_c]"
4,Budapest_PraG,100.0,[13],"""Lether""",2017/06/10,[div_d]
5,Brussels_BelgIUm,77000.0,"[67, 32]",98. Plastic,2017/10/05,"[div_b, sub_div_b]"

In [ ]:
# accidently it field also column "Date" with the value 100, which we didn't want
# Back to empty rows
df = pd.DataFrame(dic)
df

In [ ]:
# Replace Only For a Specified Columns
df.fillna( {'ProductId':100},    inplace = True)
df

In [ ]:
df.dtypes

<br>
<hr class="dotted">
<br>

### Change Data Type to <code>Date</code>

In [ ]:
# the "Date" column has 2 problemetic rows, the third and four rows.
# "to_datetime()"" method can fix that
df.Date = pd.to_datetime(df.Date)
df

In [ ]:
df.dtypes

In [ ]:
# Worked greate, accept for the empty date in row 3 got a "NaT" (Not a Time) value, in other words an empty value.
# One way to deal with empty values is simply removing the entire row.
df.dropna(subset=['Date'], inplace = True)
df

<br>
<hr class="dotted">
<br>

### Update (hard coded) a Specific Value

In [ ]:
# Look at ProductId 35, the ProductId should be 40
# Let's replace the value
df.loc[0,"ProductId"] = 40
df

<br>
<hr class="dotted">
<br>

### Loop through <code>df</code>

In [ ]:
df.index

In [ ]:
# Also we'll replace values bigger or equal to 100 with a loop
for i in df.index:
        while df.loc[i,"ProductId"] > 100:
            df.loc[i,"ProductId"] = df.loc[i,"ProductId"] / 10

            
df

Another way to iterrate on df

In [ ]:
df.iterrows()

In [ ]:
for index, row in df.iterrows():
    print(index)
    print('')
    print(row)
    print('')
    print('')
    print('')

<br>
<hr class="dotted">
<br>

### Adding new rows (hard coded)

In [ ]:
df

In [ ]:
# Adding a row
df.loc[6] = ['Tel-Aviv_Israel', None, [15], 'Iron', '2020-01-01',['div_e']]
df.loc[7] = ['Haifa_Israel', 88, [15,80], 'Iron', '2020-01-01',['div_e']]
df.Date = pd.to_datetime(df.Date)
df

In [ ]:
df

<br>
<hr class="dotted">
<br>

### Adding new Column (hard coded)

In [ ]:
df

In [ ]:
# Add a new column
df['ProductName'] = ['bottle', 'chair', 'shelf', 'jacket', 'table', 'hammer', 'hammer']

df

<br>
<hr class="dotted">
<br>

### Drop Column

In [ ]:
# Drop new column "ProductName"
df.drop('ProductName',axis=1, inplace = True)
df

<br>
<hr class="dotted">
<br>

### Drop Row

In [ ]:
# Drop row index 6
df.drop(6, inplace=True)
df

<br>
<hr class="dotted">
<br>

### Convert Data Type

In [ ]:
# Change "ProductId" column to int
df['ProductId'] = df['ProductId'].astype(int)
df

<br>
<hr class="dotted">
<br>

### Split Column based on Delimiter

In [5]:
df.Country.str.split('_', expand=True)

          0        1
0    LoNDon  britian
1  Brussels  BelgIUm
2    MAdrid    spAIN
3    londON  briTiAn
4  Budapest     PraG
5  Brussels  BelgIUm

In [6]:
# Let's organize the horible column "Country"
# First we'll split it into columns and save them in a temporary variable
x = df.Country.str.split('_', expand=True)
x

          0        1
0    LoNDon  britian
1  Brussels  BelgIUm
2    MAdrid    spAIN
3    londON  briTiAn
4  Budapest     PraG
5  Brussels  BelgIUm

In [ ]:
# And rename the columns of x as:
x.columns = ["City", "Country"]
x

In [ ]:
# Then, standardise the string capitalisation so that only the first letter is uppercase  (e.g. "londON" should become "London".)
x["City"] = x.City.str.capitalize()
x["Country"] = x.Country.str.capitalize()
x

In [ ]:
df

In [ ]:
# Last we'll drop the column "Country" from "df" and add the 2 new columns from "x"
df = df.drop('Country',axis=1)
df = df.join(x)
df

<br>
<hr class="dotted">
<br>

### Change the order the columns

In [ ]:
# Change the order the columns
df = df[  ["Country", "City", "ProductId", "Category","Division","Date", "SalesHistory"]  ]
df

<br>
<hr class="dotted">
<br>

### Extract / Clean str column - based on regx expr

#### Regex Expressions

Python regex (regular expressions) are patterns used to match strings or substrings based on specific rules.

<br>
<u>Key Components:</u>
<ul>
<li>Literal Characters: Match exact text (e.g., <code>abc</code> matches "abc")</li>
<br>
<li>Metacharacters: Special symbols with unique meanings:</li>
    <ul>
        <li><code>.</code> Matches any character except newline.
        <li><code>^</code> Matches the start of a string.
        <li><code>$</code> Matches the end of a string.
        <li><code>*, +, ?</code> Specify repetitions.
        <li><code>[]</code> Matches any character in the set (e.g., <code>[abc]</code>).
        <li><code>|</code> Acts as OR (e.g., <code>a|b</code> matches "a" or "b").
        <li><code>\</code> Escapes metacharacters or introduces special sequences (e.g., <code>\d</code> for digits).
</ul>

In [ ]:
df

In [ ]:
# Remove unwanted characters from "Category" column with "str.extract"
# "expand" argument equals "False", keeps the the values in one column
df['Category'] = df['Category'].str.extract('([a-zA-Z\\s]+)', expand=False)
df



<u>In the Example above:</u>
<br>The regex <code>([a-zA-Z\s]+)</code> matches one or more (<code>+</code>) characters that are either:

- Lowercase letters (<code>a-z</code>),
- Uppercase letters (<code>A-Z</code>), or
- Whitespace characters (<code>\s</code>)
<br></br>The parentheses <code>()</code> create a capturing group for these matched characters.

In [7]:
# str.strip()
# Remove spaces at the beginning and at the end of the string
df['Category'] = df['Category'].str.strip()
df

,Country,ProductId,SalesHistory,Category,Date,Division
0,LoNDon_britian,35.0,"[23, 47, 88]",(Broken Glass. ),2018/12/01,"[div_a, sub_div_a]"
1,Brussels_BelgIUm,77000.0,"[67, 32]",98. Plastic,2017/10/05,"[div_b, sub_div_b]"
2,MAdrid_spAIN,NaN,[],<Hard Wood> (45),2018/11/11,[]
3,londON_briTiAn,53.0,"[24, 43, 87]",STEEL(&),None,"[div_c, sub_div_c]"
4,Budapest_PraG,NaN,[13],"""Lether""",2017/06/10,[div_d]
5,Brussels_BelgIUm,77000.0,"[67, 32]",98. Plastic,2017/10/05,"[div_b, sub_div_b]"

<br>
<hr class="dotted">
<br>

### Handling non scalar values - <code>lists</code> to columns

In [8]:
# We want to fix "Division" column, the values there have been added as lists
# We want every value to be in it's own column
# We'll create a temporary variable with 2 column using the "apply" method
T = df['Division'].apply(pd.Series, dtype='object')
T

       0          1
0  div_a  sub_div_a
1  div_b  sub_div_b
2    NaN        NaN
3  div_c  sub_div_c
4  div_d        NaN
5  div_b  sub_div_b

In [ ]:
df

In [ ]:
T

In [ ]:
[ f'Division_{n}' for n in range(1, len(list(T.columns))+1)  ]

In [ ]:
# And rename "T" variable columns using a loop
T.columns = [f'Division_{n}' for n in range(1, len(T.columns)+1)]
T

In [ ]:
df

In [ ]:
# Last (like before) we'll drop the unwanted colum and "join" the 2 new columns
df = df.drop('Division', axis=1).join(T)
df

In [ ]:
df.fillna('no_div',inplace = True)
df

<br>
<hr class="dotted">
<br>

### Concat <code>df's</code>

In [ ]:
# Create a new df2

dic2 = {'Country': ['India', 'France'],
       'City': ['Delhi', 'Paris'],
        'ProductId': [40, 88],
        'Category': ['Broken Glass','Iron'],
        'Date':['2018-12-01', '2017-10-05'],
        'SalesHistory': [[23, 47,88], [67, 32]],
        'Division_1':['div_a','div_b'],
        'Division_2':['sub_div_a','sub_div_b']
        }


df2 = pd.DataFrame(dic2)
df2

In [ ]:
df

In [ ]:
# Concat df2 to df
df = pd.concat([df, df2], ignore_index=True)

df.Date = pd.to_datetime(df.Date)
df

<br>
<hr class="dotted">
<br>

### Handling non scalar values - <code>lists</code> to Rows

In [ ]:
# We Also want to fix "SalesHistory" column, the values there have been added as lists
# We want to add rows (transactions) according to the list length
T = df['SalesHistory'].apply(pd.Series, dtype = int)
T.columns = ['SalesHistory_{}'.format(n) for n in range(1, len(T.columns)+1)]
df = df.drop('SalesHistory', axis=1).join(T)
df.fillna(0,inplace = True)
df

In [ ]:
df = df.melt(id_vars=["Country", "City", "ProductId", "Category","Date","Division_1","Division_2"], var_name='s',value_name = 'Sales')
df

In [ ]:
df.sort_values(by=['Country','City'],inplace=True)
df

In [ ]:
df.reset_index(drop=True, inplace=True)
df

<br>
<hr class="dotted">
<br>

### Handle Duplicates

last but not least<br>
we have duplicated rows --> for example in "Belgium	Brussels" rows

In [ ]:
# Removing Duplicates
# First we check if there are any..
df.duplicated()
# it means that the last row has a duplicate row

In [ ]:
# Let's the duplictes
df[df.duplicated()]

In [ ]:
# Duplicate Removed
df.drop_duplicates(inplace = True)
df

In [ ]:
# last but not least
df.reset_index(drop=True, inplace=True)
df

<br>
<hr class="dotted">
<br>

### Checking Data Type

In [ ]:
df.dtypes

<br>
<hr class="dotted">
<br>

### Check Null Values <code>df</code>

In [9]:
df.isnull().sum()

Country         0
ProductId       2
SalesHistory    0
Category        0
Date            1
Division        0
dtype: int64

<br>
<hr class="dotted">
<br>

### Compare with the original <code>df</code>

In [ ]:
df

In [ ]:
# Finaly - Let's compare the new "df" to the old one
df_Old = pd.DataFrame(dic)
df_Old